Revit 2024 API
ParameterTypeId.SpaceAssocRoomName Property
 "Room Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SpaceAssocRoomName { get; }
Visual Basic
Public Shared ReadOnly Property SpaceAssocRoomName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SpaceAssocRoomName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace